package com.hillel.lesson_07.task;

public class PusUp {
    /*
    Человек подтягивается, делает подходы лесенкой начиная с 1 раза
    - подсчитать сколько он всего подтянеться за N подходов, N задано с клавиатуры
    N = 4 -> 1 + 2 + 3 + 4 = 10

    - вывести общее время выполнения упражнения (10:45)
    каждое подтягивание занимает 5с, первый перерыв между подходами 60с,
    каждый следующий перерыв на 20% больше предыдущего.
     */
    public static void main(String[] args) throws InterruptedException {

    }
}
